In [1]:
import mysql.connector

#Create connection
mydb=mysql.connector.connect(host='localhost',username='root',password='root@123')

print(mydb)

# Create database

mycursor=mydb.cursor()

<mysql.connector.connection.MySQLConnection object at 0x0000029C9FAED208>

In [4]:
# Create database

mycursor.execute("CREATE DATABASE Cus")

In [2]:
#Create a Table

mycursor.execute("USE mydatabase")
mycursor.execute('CREATE TABLE customers(name VARCHAR(255),address VARCHAR(255))')

In [6]:
#Check if table exists
mycursor.execute('SHOW TABLES')
for i in mycursor:
    print(i)

('customers',)
('students',)

In [5]:
# Create primary key creating a table

mycursor.execute("create table students(id int auto_increment primary key, name varchar(100),city varchar(50),qualification varchar(20))")

In [9]:
# Create primary key on existing table

mycursor.execute("Alter table students add column id int auto_increment primary key")

In [10]:
# Insert into table

sql="insert into students(name, city,qualification) values (%s,%s,%s)"
val=("ganesh","partur","ME")
    
mycursor.execute(sql,val)
mydb.commit()

print(mycursor.rowcount, "record inserted")

1 record inserted

In [14]:
#Insert multiple rows

sql="insert into students(name, city,qualification) values (%s,%s,%s)"
val=[("mangesh","partur","MSc"),("Gajanan","Nanded","ME")]
    
mycursor.executemany(sql,val)
mydb.commit()

print(mycursor.rowcount, "was inserted")

2 was inserted

In [13]:
#get the inserted id

print(mycursor.lastrowid)

0

In [6]:
# Select from a table

mycursor.execute("select * from students")
resul=mycursor.fetchall()
for i in resul:
    print(i)

print("\n")
# Selecting columns

mycursor.execute("select name,qualification from students")
print(mycursor.fetchall())

# If u want to get only one row
print("\n")
mycursor.execute("Select * from students")
print(mycursor.fetchone())

(1, 'ganesh', 'partur', 'ME')
(2, 'mangesh', 'partur', 'MSc')
(3, 'Gajanan', 'Nanded', 'ME')


[('ganesh', 'ME'), ('mangesh', 'MSc'), ('Gajanan', 'ME')]


(1, 'ganesh', 'partur', 'ME')

In [5]:
# Where statement: Select with a filter

sql="select * from students where city='partur'"
mycursor.execute(sql)
result=mycursor.fetchall()
for i in result:
    print(i)

(1, 'ganesh', 'partur', 'ME')
(2, 'mangesh', 'partur', 'MSc')

In [13]:
mycursor.execute("use mydatabase")
sql="select * from students where city like '%art%' "
mycursor.execute(sql)
print(mycursor.fetchall())

[(1, 'ganesh', 'partur', 'ME'), (2, 'mangesh', 'partur', 'MSc')]

In [20]:
# Prevent SQL Injection

sql="Select * from students where city=%s"
cit=("nanded",)
mycursor.execute(sql,cit)
print(mycursor.fetchall())

[(3, 'Gajanan', 'Nanded', 'ME')]

In [25]:
# MySQL Order by

#Ascending by default
sql="select * from students order by name"
mycursor.execute(sql)
print(mycursor.fetchall())

print("\n")
# Descending 
sql="select * from students order by name desc"
mycursor.execute(sql)
print(mycursor.fetchall())

[(3, 'Gajanan', 'Nanded', 'ME'), (1, 'ganesh', 'partur', 'ME'), (2, 'mangesh', 'partur', 'MSc')]


[(2, 'mangesh', 'partur', 'MSc'), (1, 'ganesh', 'partur', 'ME'), (3, 'Gajanan', 'Nanded', 'ME')]

In [32]:
# MySQL Delete From 

#Delete record

sql="select * from students"
mycursor.execute(sql)
print(mycursor.fetchall())

sql="delete from students where city='nanded'"
mycursor.execute(sql)
mydb.commit()
print(mycursor.rowcount, "records deleted")

sql2="select * from students"
mycursor.execute(sql2)
print(mycursor.fetchall())

[(1, 'ganesh', 'partur', 'ME'), (2, 'mangesh', 'partur', 'MSc'), (4, 'gajanan', 'nanded', 'ME'), (5, 'Varsha', 'nanded', 'BE')]
2 records deleted
[(1, 'ganesh', 'partur', 'ME'), (2, 'mangesh', 'partur', 'MSc')]

In [41]:
# MySQL Drop table

sql="show tables"
mycursor.execute(sql)
print(mycursor.fetchall())

sql="Drop table customers"
mycursor.execute(sql)

sql="show tables"
mycursor.execute(sql)
print(mycursor.fetchall())

# Drop only if exists
sql="drop table if exists customers"
mycursor.execute(sql)

[('customers',), ('students',)]
[('students',)]

In [47]:
# MySQL Update table

sql="select * from students"
mycursor.execute(sql)
print(mycursor.fetchall())

sql="update students set city='partur' where city='parturCircle'"
mycursor.execute(sql)
mydb.commit()
print(mycursor.rowcount,'records affected')

sql="select * from students"
mycursor.execute(sql)
print(mycursor.fetchall())

# Prevent SQL Injection
sql="update students set name=%s where name=%s "
val=('ganesh','GaneshS')
mycursor.execute(sql, val)
mydb.commit()
print(mycursor.rowcount,'records affected')

[(1, 'GaneshS', 'parturCircle', 'ME'), (2, 'mangesh', 'parturCircle', 'MSc')]
2 records affected
[(1, 'GaneshS', 'partur', 'ME'), (2, 'mangesh', 'partur', 'MSc')]
1 records affected

In [3]:
# MySQL Limit

sql="select * from students"
mycursor.execute(sql)
print(mycursor.fetchall())

sql="select * from students LIMIT 2"
mycursor.execute(sql)
print(mycursor.fetchall())

sql="select * from students limit 5 offset 1"
mycursor.execute(sql)
print(mycursor.fetchall())

[(1, 'ganesh', 'partur', 'ME'), (2, 'mangesh', 'partur', 'MSc'), (6, 'gaj', 'nanded', 'ME'), (7, 'VarshaM', 'nanded', 'BE')]
[(1, 'ganesh', 'partur', 'ME'), (2, 'mangesh', 'partur', 'MSc')]
[(2, 'mangesh', 'partur', 'MSc'), (6, 'gaj', 'nanded', 'ME'), (7, 'VarshaM', 'nanded', 'BE')]

In [52]:
# MySQL Join

In [43]:
sql="CREATE TABLE EMPLOYEE(FIRST_NAME CHAR(20) NOT NULL,LAST_NAME CHAR(20),AGE INT,SEX CHAR(1),INCOME FLOAT, CONTACT INT)"
mycursor.execute(sql)

In [44]:
sql="INSERT INTO Employee VALUES ('Ramya', 'Rama Priya', 27, 'F', 9000, 101),('Vinay', 'Bhattacharya', 20, 'M', 6000, 102),('Sharukh', 'Sheik', 25, 'M', 8300, 103),('Sarmista', 'Sharma', 26, 'F', 10000, 104),('Trupthi', 'Mishra', 24, 'F', 6000, 105)"
mycursor.execute(sql)
print(mycursor.rowcount)

5

In [45]:
sql="CREATE TABLE CONTACT(ID INT NOT NULL,   EMAIL CHAR(20) NOT NULL,   PHONE LONG,   CITY CHAR(20))"
mycursor.execute(sql)

In [46]:
sql="INSERT INTO CONTACT (ID, EMAIL, CITY) VALUES    (101, 'Krishna@mymail.com', 'Hyderabad'),    (102, 'Raja@mymail.com', 'Vishakhapatnam'),   (103, 'Krishna@mymail.com', 'Pune'),(104, 'Raja@mymail.com', 'Mumbai')"
mycursor.execute(sql)
print(mycursor.rowcount)

4

In [56]:


sql="select * from employee"
mycursor.execute(sql)
result=mycursor.fetchall()
for i in result:
    print(i)

print("\n")
sql="select * from contact"
mycursor.execute(sql)
result=mycursor.fetchall()
for i in result:
    print(i)

# Inner Join
print("\n")
sql="SELECT EMPLOYEE.FIRST_NAME,EMPLOYEE.CONTACT,CONTACT.ID from EMPLOYEE INNER JOIN CONTACT ON EMPLOYEE.CONTACT = CONTACT.ID"
mycursor.execute(sql)
result=mycursor.fetchall()
for i in result:
    print(i)

('Ramya', 'Rama Priya', 27, 'F', 9000.0, 101)
('Vinay', 'Bhattacharya', 20, 'M', 6000.0, 102)
('Sharukh', 'Sheik', 25, 'M', 8300.0, 103)
('Sarmista', 'Sharma', 26, 'F', 10000.0, 104)
('Trupthi', 'Mishra', 24, 'F', 6000.0, 105)


(101, 'Krishna@mymail.com', None, 'Hyderabad')
(102, 'Raja@mymail.com', None, 'Vishakhapatnam')
(103, 'Krishna@mymail.com', None, 'Pune')
(104, 'Raja@mymail.com', None, 'Mumbai')


('Ramya', 101, 101)
('Vinay', 102, 102)
('Sharukh', 103, 103)
('Sarmista', 104, 104)

In [58]:
# Left Outer Join

print("\n")
sql="SELECT EMPLOYEE.FIRST_NAME,EMPLOYEE.CONTACT,CONTACT.ID FROM EMPLOYEE LEFT JOIN CONTACT ON EMPLOYEE.CONTACT = CONTACT.ID"
mycursor.execute(sql)
result=mycursor.fetchall()
for i in result:
    print(i)

('Ramya', 101, 101)
('Vinay', 102, 102)
('Sharukh', 103, 103)
('Sarmista', 104, 104)
('Trupthi', 105, None)

In [59]:
# Right Outer Join

print("\n")
sql="SELECT EMPLOYEE.FIRST_NAME,EMPLOYEE.CONTACT,CONTACT.ID FROM EMPLOYEE RIGHT JOIN CONTACT ON EMPLOYEE.CONTACT = CONTACT.ID"
mycursor.execute(sql)
result=mycursor.fetchall()
for i in result:
    print(i)

('Ramya', 101, 101)
('Vinay', 102, 102)
('Sharukh', 103, 103)
('Sarmista', 104, 104)

In [65]:
# Full outer Join

print("\n")
sql="SELECT EMPLOYEE.FIRST_NAME,EMPLOYEE.CONTACT,CONTACT.ID FROM EMPLOYEE RIGHT JOIN CONTACT ON EMPLOYEE.CONTACT = CONTACT.ID"
mycursor.execute(sql)
result=mycursor.fetchall()
for i in result:
    print(i)

('Ramya', 101, 101)
('Vinay', 102, 102)
('Sharukh', 103, 103)
('Sarmista', 104, 104)